html/hacking.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-07-29 Thu 16:02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hacking on emacsbridge</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Bernd Wachter">
</head>
<body>
<div id="content">
<h1 class="title">Hacking on emacsbridge</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8cfc51b">1. Hacking on emacsbridge</a>
<ul>
<li><a href="#org9f12199">1.1. Working with the core</a>
<ul>
<li><a href="#org6475af4">1.1.1. Qt requirements</a></li>
<li><a href="#orga1e6e54">1.1.2. Preparing the sources</a></li>
<li><a href="#org1c4b3d7">1.1.3. Build helper</a></li>
<li><a href="#org76939e0">1.1.4. Debugging</a></li>
</ul>
</li>
<li><a href="#org460f309">1.2. Architecture</a>
<ul>
<li><a href="#orgb952abc">1.2.1. Connection setup</a></li>
<li><a href="#org79770f1">1.2.2. URLs</a></li>
</ul>
</li>
<li><a href="#org51e4856">1.3. Preparing the build environment</a>
<ul>
<li><a href="#org19a27fc">1.3.1. Android builds</a></li>
<li><a href="#org7a0a8b3">1.3.2. Windows builds</a></li>
</ul>
</li>
<li><a href="#org791e5e2">1.4. Resources</a>
<ul>
<li><a href="#org0c27080">1.4.1. Android</a></li>
<li><a href="#orgce5bab6">1.4.2. Qt</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org8cfc51b" class="outline-2">
<h2 id="org8cfc51b"><span class="section-number-2">1</span> Hacking on emacsbridge</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9f12199" class="outline-3">
<h3 id="org9f12199"><span class="section-number-3">1.1</span> Working with the core</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6475af4" class="outline-4">
<h4 id="org6475af4"><span class="section-number-4">1.1.1</span> Qt requirements</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
The following table contains the Qt versions suitable for compiling emacsbridge:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">OS</th>
<th scope="col" class="org-right">Version</th>
<th scope="col" class="org-left">State</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Android</td>
<td class="org-right">5.15.1</td>
<td class="org-left">recommended</td>
</tr>

<tr>
<td class="org-left">Android</td>
<td class="org-right">5.15.0</td>
<td class="org-left">minimum</td>
</tr>

<tr>
<td class="org-left">PC</td>
<td class="org-right">5.14.x</td>
<td class="org-left">minimum</td>
</tr>

<tr>
<td class="org-left">PC</td>
<td class="org-right">5.15.x</td>
<td class="org-left">recommended</td>
</tr>

<tr>
<td class="org-left">PC</td>
<td class="org-right">5.13.0</td>
<td class="org-left">compiles, works mostly, but not recommended</td>
</tr>
</tbody>
</table>
<p>
For building on PC compiling Qt is straightforward, and your distribution might already have a correct version. The following packages should pull in all the other required dependencies for building:
</p>

<ul class="org-ul">
<li>Qt5Quick</li>
<li>Qt5QuickControls2</li>
<li>Qt5WebSockets</li>
<li>Qt5RemoteObjects</li>
<li>Qt5Network</li>
<li>Qt5Sensors</li>
<li>libQt5Core-private-headers-devel</li>
</ul>

<p>
The package names are for OpenSuSE, other distributions should have similar naming.
</p>

<p>
To build for Android an Android development environment needs to be set up. It should work with Android Studio or similar, below is a summary on how to setup a non-GUI build environment.
</p>
</div>
</div>

<div id="outline-container-orga1e6e54" class="outline-4">
<h4 id="orga1e6e54"><span class="section-number-4">1.1.2</span> Preparing the sources</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Emacsbridge requires qthttpserver, which is included as a submodule. qthttpserver also has submodules. The following snippet clones the repository and initializes all submodules:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git clone https://github.com/aardsoft/emacsbridge.git
$ cd emacsbridge
$ git submodule update --init --recursive qthttpserver
</pre>
</div>

<p>
Now the code can be configured for qmake - for Android the qmake from inside the Android Qt tree needs to be called.
</p>
</div>
</div>

<div id="outline-container-org1c4b3d7" class="outline-4">
<h4 id="org1c4b3d7"><span class="section-number-4">1.1.3</span> Build helper</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
The source repository contains a build helper (<code>build.sh</code>). Outside of simple Linux builds using that might be easiest.
</p>

<p>
Variables controlling the build include:
</p>
<ul class="org-ul">
<li>ANDROID_ABIS: ABIs to build, default <code>arm64-v8a x86_64 armeabi-v7a</code></li>
<li>ANDROID_SDK_VERSION: Android SDK version to use, default <code>android-29</code>. When targetting Play store the version from the script generally is the one which has to be used.</li>
<li>QT_VERSION: The Qt version used for trying to find directories, default <code>5.15.1</code></li>
<li>QT_ANDROID_BIN: The bin directory inside of the Qt Android installation, defaulting to <code>$HOME/qt/qt${QT_VERSION}-${ANDROID_SDK_VERSION}/bin</code></li>
<li>QT_WINDOWS_BIN: The bin directory inside of the Windows Qt installation, defaulting to <code>$HOME/qt/qt${QT_VERSION}-mingw64/bin</code></li>
<li>WIN32_OBJDUMP: The name of the objdump binary for Windows, default <code>x86_64-w64-mingw32-objdump</code></li>
<li>WIN32_SYSROOT: Path to the mingw32 sysroot, default <code>/usr/x86_64-w64-mingw32/sys-root/mingw/bin</code></li>
<li>WIN32_PLUGINS: List of win32 plugins to use, default <code>platforms</code></li>
<li>BUILD_DIR: Name of the build directory, default <code>build</code></li>
<li>QMAKE_CXX: The C++ compiler to use for PC, default <code>clang++</code></li>
<li>QMAKE_LINK: The linker to use for PC, default <code>clang++</code></li>
</ul>
</div>
</div>

<div id="outline-container-org76939e0" class="outline-4">
<h4 id="org76939e0"><span class="section-number-4">1.1.4</span> Debugging</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
To see what goes over the local socket, start socat and adjust socket address:
</p>

<p>
while true; do echo "Restart."; socat -v GOPEN:/tmp/Emacs1000/server UNIX-LISTEN:/tmp/es; done
</p>

<p>
Building for Android and Windows requires a proper cross-compiled toolchain,
</p>
</div>
</div>
</div>

<div id="outline-container-org460f309" class="outline-3">
<h3 id="org460f309"><span class="section-number-3">1.2</span> Architecture</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The application is separated into a client and a server part, communicating via <a href="https://doc.qt.io/qt-5/qtremoteobjects-index.html">Qt Remote Objects</a>
</p>
</div>
<div id="outline-container-orgb952abc" class="outline-4">
<h4 id="orgb952abc"><span class="section-number-4">1.2.1</span> Connection setup</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Emacsbridge starts up with some open settings endpoints to make initial configuration easier. To set the connection up,
</p>

<ul class="org-ul">
<li>Emacs provides information about its server connection</li>
<li>Emacsbridge uses that to connect to Emacs. If that connection was successful it will disable the open endpoints, and make the RPC interface available.</li>
</ul>
</div>
</div>
<div id="outline-container-org79770f1" class="outline-4">
<h4 id="org79770f1"><span class="section-number-4">1.2.2</span> URLs</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="org5f59f9a"></a>/icons<br>
<div class="outline-text-5" id="text-1-2-2-1">
<p>
Icons bundled with the application. Served without modification, directory index is enabled. No authentication required.
</p>
</div>
</li>
<li><a id="org115eab6"></a>/lisp<br>
<div class="outline-text-5" id="text-1-2-2-2">
<p>
Lisp files bundled with the application. Served without modification, directory index is enabled. No authentication required.
</p>
</div>
</li>
<li><a id="org8820fd6"></a>/rpc<br>
<div class="outline-text-5" id="text-1-2-2-3">
<p>
Expects JSON data in a POST request, with a valid auth token. The method for which JSON data is sent must be specified in the <code>method</code> header. Only available after initial setup has been completed. The following methods are available:
</p>
</div>
<ol class="org-ol">
<li><a id="org49284b5"></a>addComponent<br>
<div class="outline-text-6" id="text-1-2-2-3-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">required</th>
<th scope="col" class="org-left">default</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">in-drawer</td>
<td class="org-left">no</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left">qmlData</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">qmlFile</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">title</td>
<td class="org-left">no</td>
<td class="org-left"><code>qmlFile</code></td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgdba01d0"></a>setData<br></li>
<li><a id="org9f9d83c"></a>notification<br>
<div class="outline-text-6" id="text-1-2-2-3-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">required</th>
<th scope="col" class="org-left">default</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">title</td>
<td class="org-left">no</td>
<td class="org-left">"Missing notification title"</td>
</tr>

<tr>
<td class="org-left">text</td>
<td class="org-left">no</td>
<td class="org-left">"Missing notification text"</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org8d12295"></a>intent<br>
<div class="outline-text-6" id="text-1-2-2-3-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">required</th>
<th scope="col" class="org-left">default</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">action</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">data</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">package</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">class</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">extra</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">startType</td>
<td class="org-left">no</td>
<td class="org-left">"activity"</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-Emacs-lisp">(emacsbridge-post-json "intent" (json-encode `((:package . "com.termux")
					       (:startType . "service")
					       (:class . "com.termux.app.RunCommandService")
					       (:extra . (((:type . "string")
							   (:key . "com.termux.RUN_COMMAND_PATH")
							   (:value . "/data/data/com.termux/files/usr/bin/ps"))
							  ((:type . "stringarray")
							   (:key . "com.termux.RUN_COMMAND_ARGUMENTS")
							   (:value . (((:value . "a"))
								      ((:value . "x")))))))
					       (:action . "com.termux.RUN_COMMAND"))))
</pre>
</div>
</div>
</li>
<li><a id="orgc0ab9fa"></a>sensor<br></li>
<li><a id="orgf8fb3bf"></a>removeComponent<br></li>
</ol>
</li>
<li><a id="orge7af792"></a>/scripts<br>
<div class="outline-text-5" id="text-1-2-2-4">
<p>
Shell scripts bundled with the application. Served with simple template expansion, directory index is enabled.
</p>
</div>
</li>
<li><a id="orgf9bbb44"></a>/settings<br></li>
<li><a id="orga825a89"></a>/test_connection<br>
<div class="outline-text-5" id="text-1-2-2-6">
<p>
Returns a page reporting the setup status of the connection to Emacs in human friendly text. No authentication required.
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org51e4856" class="outline-3">
<h3 id="org51e4856"><span class="section-number-3">1.3</span> Preparing the build environment</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org19a27fc" class="outline-4">
<h4 id="org19a27fc"><span class="section-number-4">1.3.1</span> Android builds</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
First the directory structure gets prepared, and some variables need to be set. The SDK directory used here is <code>~/.android/sdk</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">export</span> <span style="font-weight: bold; font-style: italic;">ANDROID_SDK_ROOT</span>=$<span style="font-weight: bold; font-style: italic;">HOME</span>/.android/sdk
<span style="font-weight: bold;">export</span> <span style="font-weight: bold; font-style: italic;">ANDROID_HOME</span>=$<span style="font-weight: bold; font-style: italic;">HOME</span>/.android/sdk
mkdir -p $<span style="font-weight: bold; font-style: italic;">ANDROID_HOME</span>
</pre>
</div>

<p>
Next the command line tools need to be downloaded from <a href="https://developer.android.com/studio#downloads">the Android SDK download page</a> in the 'Command line tools only' section, and extracted:
</p>

<div class="org-src-container">
<pre class="src src-shell">unzip -d $<span style="font-weight: bold; font-style: italic;">ANDROID_HOME</span> ~/Downloads/commandlinetools-linux-6858069_latest.zip
<span style="font-weight: bold;">export</span> <span style="font-weight: bold; font-style: italic;">PATH</span>=$<span style="font-weight: bold; font-style: italic;">PATH</span>:$<span style="font-weight: bold; font-style: italic;">ANDROID_HOME</span>/cmdline-tools/tools/bin
</pre>
</div>

<p>
Now sdkmanager can be used to initialize the SDK and download required packages:
</p>

<div class="org-src-container">
<pre class="src src-shell">sdkmanager --verbose --licenses
sdkmanager --update
sdkmanager <span style="font-style: italic;">"platforms;android-29"</span> <span style="font-style: italic;">"ndk-bundle"</span> <span style="font-style: italic;">"build-tools;30.0.2"</span> <span style="font-style: italic;">"platform-tools"</span> <span style="font-style: italic;">"tools"</span>
</pre>
</div>

<p>
Next Qt needs to be Downloaded (<a href="http://download.qt.io/official_releases/qt/5.15/5.15.1/single/qt-everywhere-src-5.15.1.tar.xz.mirrorlist">5.15.1 mirror list</a>), extracted and built:
</p>

<div class="org-src-container">
<pre class="src src-shell">tar xf qt-everywhere-src-5.15.1.tar.xz
<span style="font-weight: bold;">cd</span> qt-everywhere-src-5.15.1
./configure -opensource -confirm-license -android-abis armeabi-v7a,arm64-v8a,x86_64 -xplatform android-clang --disable-rpath -nomake tests -nomake examples -no-warnings-are-errors -android-ndk $<span style="font-weight: bold; font-style: italic;">HOME</span>/.android/sdk/ndk-bundle -android-sdk $<span style="font-weight: bold; font-style: italic;">HOME</span>/.android/sdk/platforms -android-ndk-platform android-29 -prefix $<span style="font-weight: bold; font-style: italic;">HOME</span>/qt/qt5.15.1-android-29
make -j$(<span style="font-weight: bold;">nproc</span>)
make -j$(<span style="font-weight: bold;">nproc</span>) install
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a0a8b3" class="outline-4">
<h4 id="org7a0a8b3"><span class="section-number-4">1.3.2</span> Windows builds</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
The Windows version is highly experimental, seems to segfault due to issues with Qt remote objects, and probably won't see any work unless I'm very bored or somebody is interested in actually using it on Windows. Therefore the following just contains a few pointers for a chance to have a build environment.
</p>

<p>
A Visual Studio build might have the best chances to actually work, but probably will require code changes. MinGW compiles without code changes. On OpenSuSE probably the following packages are required:
</p>

<ul class="org-ul">
<li>mingw64-cross-pkgconf</li>
<li>mingw64-libicu-devel</li>
<li>mingw64-angleproject-devel</li>
<li>mingw64-cross-binutils</li>
<li>mingw64-cross-gcc</li>
<li>mingw64-cross-gcc-c++</li>
<li>mingw64-cross-pkg-config</li>
<li>mingw64-dbus-1-devel</li>
<li>mingw64-filesystem</li>
<li>mingw64-libicu-devel</li>
<li>mingw64-libjpeg-devel</li>
<li>mingw64-libopenssl-devel</li>
<li>mingw64-libpng-devel</li>
<li>mingw64-libtiff-devel</li>
<li>mingw64-mysql-connector-c-devel</li>
<li>mingw64-pcre-devel</li>
<li>mingw64-sqlite-devel</li>
<li>mingw64-zlib-devel</li>
<li>mingw64-libharfbuzz-devel</li>
<li>mingw64-glib2-devel</li>
<li>mingw64-libintl-devel</li>
</ul>

<p>
With those installed this should provide a more or less working build of Qt for Windows:
</p>

<div class="org-src-container">
<pre class="src src-shell">rm -Rf qtactiveqt
./configure -opensource -confirm-license -xplatform win32-g++ -device-option <span style="font-weight: bold; font-style: italic;">CROSS_COMPILE</span>=x86_64-w64-mingw32- -nomake examples -release -make tools -prefix $<span style="font-weight: bold; font-style: italic;">HOME</span>/qt/qt5.15.0-mingw64 -opengl desktop -skip qtlocation -skip qtactiveqt
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org791e5e2" class="outline-3">
<h3 id="org791e5e2"><span class="section-number-3">1.4</span> Resources</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org0c27080" class="outline-4">
<h4 id="org0c27080"><span class="section-number-4">1.4.1</span> Android</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li><a href="https://developer.android.com/guide/topics/providers/contacts-provider">Android contacts provider</a></li>
<li><a href="https://developers.google.com/maps/documentation/urls/guide">Google Maps URL schemes</a></li>
<li><a href="https://developer.android.com/training/sync-adapters">Android sync adapters</a></li>
<li><a href="https://developer.android.com/guide/topics/providers/content-providers">Android content providers</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgce5bab6" class="outline-4">
<h4 id="orgce5bab6"><span class="section-number-4">1.4.2</span> Qt</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li><a href="https://www.qt.io/blog/2019/01/25/introducing-qt-http-server">Qt Http Server announcement</a></li>
<li><a href="https://bugreports.qt.io/browse/QTBUG-60105">QTBUG-60105 Lightweight HTTP server</a></li>
<li><a href="https://doc.qt.io/qt-5/qtremoteobjects-index.html">Qt Remote objects</a></li>
<li><a href="https://doc.qt.io/qt-5/android-services.html">Android services with Qt</a></li>
<li><a href="https://doc.qt.io/qt-5/qtandroidextras-index.html">Android extras</a> <a href="https://raymii.org/s/articles/Get_Started_With_The_Nitrokey_HSM.html~/">(git)</a></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bernd Wachter</p>
<p class="date">Created: 2021-07-29 Thu 16:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
